onegbps/files/huawei/FTTH_IPTV_ADD_22.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:os="os.xsd.v1">
   <soapenv:Header>
     <wsse:Security soapenv:mustUnderstand="1" xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
    <wsse:UsernameToken wsu:Id="UsernameToken-2" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">
      <wsse:Username>clarity</wsse:Username>
      <wsse:Password >Test1234#</wsse:Password>
    </wsse:UsernameToken>
  </wsse:Security>
   </soapenv:Header>
   <soapenv:Body>
      <os:MODIFY-ONTPORT>
         <os:MODIFIER>ONTPORT</os:MODIFIER>
         <os:object>
            <os:DEV>ADSL_ZTE_DNAME</os:DEV>
            <os:FN>FTTH_HUW_FN</os:FN>
            <os:SN>FTTH_HUW_SN</os:SN>
            <os:PN>FTTH_HUW_PN</os:PN>
            <os:ONTID>FTTH_HUW_VP</os:ONTID>
            <os:ONTPORTTYPE>ETH</os:ONTPORTTYPE>
            <os:ONTPORTID>3</os:ONTPORTID>
         </os:object>
         <os:Session>1</os:Session>
         <os:objectParas>
            <os:VLANDEFAULT>30</os:VLANDEFAULT>
            <os:PRIORITY>4</os:PRIORITY>
         </os:objectParas>
      </os:MODIFY-ONTPORT>
   </soapenv:Body>
</soapenv:Envelope>
